app/admin/packs.rb

  scope -> {"비공개"}, :unpublished

  index do
    selectable_column

	id_column

	column :image do |pack|
	  	if pack.image.attached?
		  image_tag url_for(pack.image), class: "small_img"
		else
		  "이미지 없음"
		end
	end
	column :product_name
	column :company_name
	column :price do |pack|
	  number_to_currency(pack.price)
	end
	column :is_publish


	actions
  end

  batch_action :publish do |ids|
	@packs = Pack.where(id: ids)

	@packs.each do |pack|
	  pack.update(is_publish: true)
---
SELECT "packs".* FROM "packs" WHERE "packs"."id" IN (?, ?)  [["id", 4], ["id", 3]]
UPDATE "packs" SET "is_publish" = ?, "updated_at" = ? WHERE "packs"."id" = ?  [["is_publish", "t"], ["updated_at", "2021-12-01 05:04:21.595902"], ["id", 3]]

  batch_action :unpublish do |ids|
	@packs = Pack.where(id: ids)

	@packs.each do |pack|
	  pack.update(is_publish: false)
---
SELECT "packs".* FROM "packs" WHERE "packs"."id" IN (?, ?)  [["id", 4], ["id", 3]]
UPDATE "packs" SET "is_publish" = ?, "updated_at" = ? WHERE "packs"."id" = ?  [["is_publish", "f"], ["updated_at", "2021-12-01 05:05:31.849928"], ["id", 3]]