app/admin/users.rb


	column :email
	column "장바구니 유무" do |user|
	  user.carts.present?
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]