app/controllers/carts_controller.rb

  def create
    Cart.create(
	  pack_id: params[:pack_id],
	  user_id: current_user.id,
	  quantity: params[:quantity]
	)
---
INSERT INTO "carts" ("user_id", "pack_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["pack_id", 169], ["quantity", 2], ["created_at", "2021-12-01 10:03:47.907793"], ["updated_at", "2021-12-01 10:03:47.907793"]]